#include <stdio.h>
#include <string.h>
#include <stdlib.h>

struct tar_t
{                              /* byte offset */
    char name[100];               /*   0 */
    char mode[8];                 /* 100 */
    char uid[8];                  /* 108 */
    char gid[8];                  /* 116 */
    char size[12];                /* 124 */
    char mtime[12];               /* 136 */
    char chksum[8];               /* 148 */
    char typeflag;                /* 156 */
    char linkname[100];           /* 157 */
    char magic[6];                /* 257 */
    char version[2];              /* 263 */
    char uname[32];               /* 265 */
    char gname[32];               /* 297 */
    char devmajor[8];             /* 329 pas */ 
    char devminor[8];             /* 337 pas */
    char prefix[155];             /* 345 pas */
    char padding[12];             /* 500 pas */
};

/**
 * transform a decimal integer into an octal value
 * @param dec: the decimal value to transform
 * @param to_ret: the octal value stored into a char*
 */
void dec_to_oct(int dec, char* to_ret){
   int oct = 0;
   int i = 1;
   while(dec !=0){
    oct = oct +(dec%8)*i;
    dec = dec/8;
    i = i*10;
   }
   sprintf(to_ret, "%d", oct);
}


/**
 * Create a tar file with a header and a content
 * @param to_write: The tar header
 * @param content_of_file: the content of the file to put on a tar
 */
int write_in_file(struct tar_t* to_write, char* content_of_file){
    FILE* fichier = NULL;
    fichier = fopen("archive.tar", "w+");
    char* end_of_archive = (char *) calloc(1024, sizeof(char));

    if (fichier != NULL)
    {
